name: "preprocess"
backend: "python"
input [
  {
    name: "INPUT0"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ 1, 3, -1, -1 ]
  }
]

instance_group [
  {
    count: 4
    kind: KIND_CPU
  }
]
