name: "ensemble_edsr"
platform: "ensemble"
input [
  {
    name: "input"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 1, 3, -1, -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: 1
      input_map {
        key: "INPUT0"
        value: "input"
      }
      output_map {
        key: "OUTPUT0"
        value: "preprocess_output"
      }
    },
    {
      model_name: "edsr_trt"
      model_version: 1
      input_map {
        key: "input"
        value: "preprocess_output"
      }
      output_map {
        key: "output"
        value: "output"
      }
    }
  ]
}